[
  {
    "employer": "Softwire",
    "from": "Jun 2018",
    "to": "present",
    "location": "London, UK",
    "summary": "**Experience Overview**\n\nMid-level full-stack software developer with experience across a broad range of projects for customers in FinTech, health & fitness, public sector, telecommunications, aviation, and utilities. Each project implemented a unique tech stack, requiring a strong understanding of core coding principles and a flexible mindset to quickly ramp up, ensuring team effectiveness and customer satisfaction.\n\n**About Me**\n\nI am motivated to be a software developer because I enjoy problem solving, working in a trusting and collaborative environment, and designing and implementing elegant designs. I began my professional career as a change management consultant but in 2018 I decided I wanted a different career path. So, I applied to Makers Academy and learned to code in just 4 months.",
    "projects": [
      {
        "name": "Starling Bank",
        "role": "Full-Stack Developer",
        "from": 2019,
        "to": "present",
        "techStack": [
          "React (JavaScript)",
          "Redux",
          "Java",
          "Springboot",
          "Docker",
          "PostgreSQL"
        ],
        "description": "Working in a team responsible for developing new features for Starling as part of its recent CIF Funding award. Currently developing features for Starling's 'Internet Bank' to provide users (initially small business owners) with a web based interface to expand it beyond its app."
      },
      {
        "name": "David Lloyd",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (Typescript)",
          "Java",
          "Springboot",
          "Maven",
          "PHP",
          "Docker",
          "PostgreSQL",
          "MySql"
        ],
        "description": "Worked in a large team to accelerate David Lloyd's digital transformation roadmap. My role included work to:\n* upgrade their public facing website to increase membership sign-ups by providing a modern design and customisable content via a custom-made Content Management System;\n* upgrade their internal booking system to automate manual processes and improving the code base by extracting an old PHP monolith into Java microservices;\n* create a new membership registration app for in-club sales teams to improve the registration process and experience for both staff and prospective members."
      },
      {
        "name": "Air Charter Service",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (JavaScript)",
          "C#",
          "ASP.NET",
          "MySQL"
        ],
        "description": "Worked in a team to upgrade ACS' suite of outdated apps, including sales reporting, quote-generation and booking system for chartering private jets."
      },
      {
        "name": "Air Charter Service",
        "role": "Data Engineer / Consultant",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "Tableau",
          "SQL"
        ],
        "description": "GRAPHS"
      }
    ]
  },
  {
    "employer": "Makers Academy",
    "from": "Feb 2018",
    "to": "May 2018",
    "location": "London, UK",
    "summary": "Intensive 4-month coding bootcamp, learning-through-doing the foundations of software development and its best practices. Whilst the course was taught primarily in Ruby and JavaScript (implementing various popular libraries and frameworks, such as Sinatra, Express.js, npm, JQuery, etc.) students developed skills and knowledge in a language-agnostic way.",
    "projects": [
      {
        "name": "Codecraft",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "JavaScript",
          "HTML",
          "CSS",
          "JQuery"
        ],
        "description": "Codecraft is a strategic survival role playing game developed in pure vanilla JavaScript - with no game engines or frameworks. Codecraft is the Makers Academy final project developed by a team of 5 people: Tom Duffy, Julian Ng, Chris Ly, Charlene Bastians and Alfie Darko.\nThe focus of the project was to learn how to create a well-designed game, as opposed to focusing on learning new technology or coming out with a polished marketable product. In the end, we created a fully working game which has been deployed online via Heroku: https://codecraft-game.herokuapp.com/"
      }
    ]
  }
]