[
  {
    "employer": "Softwire",
    "from": "Jun 2018",
    "to": "present",
    "location": "London, UK",
    "summary": "Mid-level full-stack software developer in a medium-sized agency & consultancy. I have worked across a broad range of projects for customers in FinTech, health & fitness, public sector, telecommunications, aviation, and utilities. Each project implemented a unique tech stack, requiring a strong understanding of core coding principles and a flexible mindset to quickly ramp up, ensuring team effectiveness and customer satisfaction.",
    "projects": [
      {
        "name": "Starling Bank",
        "role": "Full-Stack Developer",
        "from": 2019,
        "to": "present",
        "techStack": [
          "React (JavaScript)",
          "Redux",
          "Java",
          "Springboot",
          "Docker",
          "PostgreSQL"
        ],
        "description": "Working in a team responsible for developing new features for Starling as part of its recent CIF Funding award. Currently developing features for Starling's 'Internet Bank' to provide its business users with a web based 'Tool Kit'. As well as providing an interface to its standard app-based features, this Tool Kit provides additional features to support businesses, such as creating invoices, tracking bills and expenses, and calculating tax.\n\nSpecific work that I have completed includes:\n* Implementing the endpoint to attach receipts to expenses\n* Enabling previewing of PDFs in place (without downloading)\n* Retrieving data from endpoints to feed into a PDF document generator, with appropriate data 'snapshotting' into a database\n* Applying styles to dynamically display pages and components correctly across various breakpoints"
      },
      {
        "name": "David Lloyd",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (Typescript)",
          "Java",
          "Springboot",
          "Maven",
          "PHP",
          "Docker",
          "PostgreSQL",
          "MySql"
        ],
        "description": "Worked across a range of products to accelerate David Lloyd's digital transformation roadmap. Their plan was split across workstreams to increase new memebership, improve retention, increase sales & subscriptions (e.g. to classes and courses) and streamline their internal processes to improve efficiency.\n\nMy role included work to:\n* Upgrade their public facing website to increase membership sign-ups by providing a modern design and customisable content via a custom-made Content Management System;\n* Upgrade their internal booking system to automate manual processes and improving the code base by extracting an old PHP monolith into Java microservices;\n* Create a new membership registration app for in-club sales teams to improve the registration process and experience for both staff and prospective members."
      },
      {
        "name": "Air Charter Service",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (JavaScript)",
          "C#",
          "ASP.NET",
          "MySQL"
        ],
        "description": "The Air Charter Service (ACS) provides first-class private jet chartering; however, some of their systems were in need to updating to improve useability and reliability. This included their internal apps for sales reporting, quote-generation and booking system, and also the creation of a customer-facing charter query website.\n\nMy work included:\n* Implementing flight date selection warning messages.\n* Updating email template languages based on backend settings.\n* Standardising commonly used features/elements\n* Resolving tech debt by removing/replacing old code, unused libraries, and poorly structured code.\n* Implementing a file upload validation feature."
      },
      {
        "name": "Air Charter Service",
        "role": "Data Engineer / Consultant",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "Tableau",
          "SQL"
        ],
        "description": "Worked closely with the client in a small team to deliver a customised sales and financial reporting suite. This provided exec-level stakeholders with a detailed but quick to understand overview of the business at any defined moment. We used Tableau, an industry recognised off the shelf data mining and visualisation product.\n\nConnecting to the client's private secure SQL databases, I built from the ground up the multiple interactive reports, tailored to the customer's stringent specifications. This required generating complex SQL queries to accurately extract, filter and manipulate the customer's database. I also delivered the training to the end users at the end of the project."
      },
      {
        "name": "NHS Improvement",
        "role": "Front-end Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (JavaScript)",
          "C#",
          "MySQL"
        ],
        "description": "Worked closely with the NHS Improvement team to deliver their 'Model Hospital' internal website. This provided NHS administrators, managers and executives with tools and visualisations to assess and compare the quality of their services and facilities against other hospitals', regional and nationwide standards. My work included:\n* Adding accessibility features for the partially sighted and hard of hearing."
      }
    ]
  },
  {
    "employer": "Makers Academy",
    "from": "Feb 2018",
    "to": "May 2018",
    "location": "London, UK",
    "summary": "Intensive 4-month coding bootcamp, learning-through-doing the foundations of software development and its best practices. Whilst the course was taught primarily in Ruby and JavaScript (implementing various popular libraries and frameworks, such as Sinatra, Express.js, npm, JQuery, etc.) students developed skills and knowledge in a language-agnostic way. Some of the key principles and skills that I learnt were Test Driven Development, pair programming, SOLID, XP Values, and system diagramming / architecture.",
    "projects": [
      {
        "name": "Codecraft",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "JavaScript",
          "HTML",
          "CSS",
          "JQuery"
        ],
        "description": "Codecraft is a strategic survival role playing game developed in pure vanilla JavaScript - with no game engines or frameworks. Codecraft was my Makers Academy final project developed by a team of 5 people in just 2 weeks.\nThe focus of the project was to learn how to create a well-designed game, as opposed to focusing on learning new technology or coming out with a polished marketable product. In the end, we created a fully working game which has been deployed online via Heroku: https://codecraft-game.herokuapp.com/.\n\nWe followed a TDD approach throughout to ensure code quality; built the game up from basic principles as we were all new to game logic (involving a lot of maths and physics); and implmented a combination of independent, pair and mob programming. I also held the role of Project Manager and was responsible for:\n* Organising and tracking daily stand-ups and retros to maintain team communication, coordination, and morale.\n* Tracked team progress to ensure the most appropriate/important features were being implemented and to schedule.\n* Monitored progress to ensure we could hit the deadline with a working and satisfactory product."
      }
    ]
  },
  {
    "employer": "Higher Education - Economics with Study Abroad (BSc Hons, 2:1)",
    "from": "2005",
    "to": "2009",
    "location": "University of Bristol, UK",
    "summary": "Core modules included microeconomics, macroeconomics, quantitative economics, and game theory. This was a 4 year sandwich course which included a year studying abroad in Spain at the Universitat de Valencia, where all modules were taken in the Spanish language.\n\nI also joined the university's Tae Kwon Do Club where I earned my Kukkikwon 1st Dan Black Belt.",
    "projects": [
    ]
  },
  {
    "employer": "Sixth Form Education - A-Levels",
    "from": "2003",
    "to": "2005",
    "location": "Hills Road Sixth Form College, Cambridge, UK",
    "summary": "Mathematics (A), Chemistry (A), Spanish (A), English Literature (A)",
    "projects": [
    ]
  }
]