[
  {
    "employer": "Pollen",
    "from": "Sep 2021",
    "to": "May 2022",
    "location": "London, UK",
    "summary": "Pollen is an events and experience \"scale-up\" tech company which builds, curates and delivers unique and tailorable experiences. As a backend software engineer for the Experience Operations engineering team, I worked in a close-knit team consisting of backend & frontend engineers, designer, product manager, and team manager to develop and deliver features to support the business. These apps are used by Pollen staff on-site during events to manage access control, which encapsulates: \n* Empowering pre-event and on-site staff to view and manage expected attendees in each event area and experience. \n* Ensuring event attendees are only able to get into the areas and experiences that they have purchased. \n* Supporting the business with changes to bookings (e.g. replacing lost wristbands). \n\nI regularly engaged with engineers and stakeholders from other teams to ensure that intended changes to the codebase are communicated and non-breaking of other features. \nThe techstack I principally used was Python, Django, GraphQL, and PostgreSQL, but I also extended out to develop features and tools outside of the core codebase with [Retool](https://retool.com/) (JavaScript), and [MongoDB Atlas & Realm](https://www.mongodb.com/atlas) (cloud data platform and database).",
    "projects": []
  },
  {
    "employer": "Softwire",
    "from": "Jun 2018",
    "to": "Sep 2021",
    "location": "London, UK",
    "summary": "Mid-level full-stack software developer in a medium-sized agency & consultancy. I have worked across a broad range of projects for customers in FinTech, health & fitness, public sector, telecommunications, aviation, and utilities. Each project implemented a unique tech stack, requiring a strong understanding of core coding principles and a flexible mindset to quickly get started, ensuring team effectiveness and customer satisfaction.",
    "projects": [
      {
        "name": "Stageclip",
        "role": "Technical Lead",
        "from": 2020,
        "to": "present",
        "techStack": [
          "React (Typescript)",
          "Redux",
          "Azure",
          "Docker",
          "PostgreSQL"
        ],
        "description": "Technical Lead for delivering an upgrade to Stageclip's core video creation and processing service, integrating with Adobe After Effects. This will enable them to improve the quality of their core product, whilst not affecting their parallel migration to a new user platform being developed separately. In this role, I am responsible for:\n* Implementing an Agile approach and concepts to manage work and productivity - kanban, sprints, regular cross-team communication, acceptance criteria, user stories;\n* Ensuring my team members have the knowledge and support to complete their tasks;\n* Gathering requirements, refining the technical specification, and writing tickets;\n* Managing the expectations of the Stageclip CTO through regular updates on project progress, risks and actions;\n* Working closely with managers and Stageclip’s engineering partner to ensure timely and effective delivery;\n* Exploring and developing opportunities for new work;\n* Code reviews, mentoring and providing team feedback."
      },
      {
        "name": "Starling Bank",
        "role": "Full-Stack Developer",
        "from": 2019,
        "to": 2020,
        "techStack": [
          "React (JavaScript)",
          "Redux",
          "Java",
          "Springboot",
          "Docker",
          "PostgreSQL"
        ],
        "description": "Worked in a team responsible for delivering several projects to develop new features for Starling as part of its 2019 CIF Funding award. Maintained close and regular communication with the customer, stakeholders and partner companies throughout in this strict and sensitive industry.\n* Business Toolkit - a premium web-based toolkit for businesses to simplify the management of their finances and operations. Provides an interface to Starling’s standard app-based features plus unique features to support businesses, such as: managing invoices; tracking bills & expenses; and calculating tax.\n* CBILS - a customer-facing web app and internal management tools and features to allow small businesses to apply for the “Coronavirus Business Interruption Loan Scheme”. Primary benefits include: (1) qualification self-verification by customer; (2) using third-party APIs to simplify application submission and assessment processes; and (3) freeing up time and resources for Starling to focus on high-priority, eligible applications.\n* Account Comparison Tool - a customer-facing web app and an internal Content Management System for businesses to view and compare a wide variety of UK bank accounts. Helps potential customers to make an informed choice on if and how Starling is best suited for their specific needs by providing a better user experience than simple product comparison websites."
      },
      {
        "name": "David Lloyd",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (Typescript)",
          "Java",
          "Springboot",
          "Maven",
          "PHP",
          "Docker",
          "PostgreSQL",
          "MySQL"
        ],
        "description": "Worked across a range of products to accelerate David Lloyd's digital transformation roadmap. Their plan was split across workstreams to increase new membership, improve retention, increase sales & subscriptions (e.g. to classes and courses) and streamline their internal processes to improve efficiency.\n\nMy role included work to:\n* Upgrade their public facing website to increase membership sign-ups by providing a modern design and customisable content via a custom-made Content Management System;\n* Upgrade their internal booking system to automate manual processes and improving the code base by extracting an old PHP monolith into Java microservices;\n* Create a new membership registration app for in-club sales teams to improve the registration process and experience for both staff and prospective members."
      },
      {
        "name": "Air Charter Service",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (JavaScript)",
          "C#",
          "ASP.NET",
          "MySQL"
        ],
        "description": "The Air Charter Service (ACS) is a global company providing customer-led private air chartering services. To facilitate this tailored service - of matching customer needs and wants to the right aircraft and airline - they use their internal Integrated Brokerage Operating System (IBOS). It provides access to all enquiries, client histories, airline data and aircraft specifications. It is a company-wide database with multiple functions (such as aircraft/airline search, bookings, quote-generation, and invoicing) and management information (such sales reporting).\n\nOn this project, my team was responsible for upgrading IBOS by fixing pre-existing bugs, improving inefficient code, and upgrading it with new features. We also led the creation of a customer-facing charter query website.\n\nSpecifically, my work included:\n* Implementing flight query validation on the website front- and back-ends.\n* Updating email template languages based on backend settings.\n* Standardising commonly used features and elements\n* Resolving tech debt by removing/replacing old code, unused libraries, and poorly structured code.\n* Implementing a file upload validation feature."
      },
      {
        "name": "Air Charter Service",
        "role": "Data Engineer / Consultant",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "Tableau",
          "SQL"
        ],
        "description": "Worked closely with the client in a small team to deliver a customised sales and financial reporting suite. This provided exec-level stakeholders with a detailed but quick to understand overview of the business at any defined moment. We used Tableau, an industry recognised off the shelf data mining and visualisation product.\n\nConnecting to the client's private secure SQL databases, I built from the ground up the multiple interactive reports, tailored to the customer's stringent specifications. This required generating complex SQL queries to accurately extract, filter and manipulate the customer's database. I also delivered the training to the end users at the end of the project."
      },
      {
        "name": "NHS Improvement",
        "role": "Front-End Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "React (JavaScript)",
          "C#",
          "MySQL"
        ],
        "description": "Worked closely with the NHS Improvement team to augment their 'Model Hospital' internal website. This provides NHS administrators, managers and executives with tools and visualisations to assess and compare the quality of their services and facilities against other hospitals' standards in other regions and country-wide. Through this, they can identify specific areas and actions to improve patient care and staff effectiveness. My work included:\n* Adding accessibility features for the partially sighted and hard of hearing.\n* Adding Google Analytics to track user behaviour.\n* Implementing a pop-up user poll to gather feedback on the site."
      },
      {
        "name": "Other Projects",
        "role": "Various",
        "from": 2018,
        "to": 2020,
        "techStack": [
          "React",
          "JavaScript",
          "Typescript",
          "Ruby",
          "Docker",
          "MySQL",
          "AWS"
        ],
        "description": "Other projects that I have worked on include:\n* Climate Change Tool (Full-Stack Developer): Working closely with a large global consultancy firm to productise a tool which assesses the risks that climate change could pose to their customers' investments and provides recommended actions.\n* Southern Water Prototype (Front-End Developer): Developing a prototype web app for a customer to deliver to Southern Water stakeholders as a key part of their value proposition.\n* Channel 5 (Full-Stack Developer): Creation of a new service to manage cookies and GDPR consent for Channel 5's web users. Bug fixing of their content management system.\n* Softwire 'Toast' (Front-End Developer): Taking a pre-existing, in-house, Windows-only program (for publicly sending praise to colleagues) and developing a web app to extend access to more users."
      }
    ]
  },
  {
    "employer": "Makers Academy",
    "from": "Feb 2018",
    "to": "May 2018",
    "location": "London, UK",
    "summary": "Intensive 4-month coding bootcamp, learning-through-doing the foundations of software development and its best practices. Whilst the course was taught primarily in Ruby and JavaScript (implementing various popular libraries and frameworks, such as Sinatra, Express.js, npm, JQuery, etc.) students developed skills and knowledge in a language-agnostic way. Some of the key principles and skills that I learnt were Test Driven Development, pair programming, SOLID, XP Values, and system diagramming / architecture.",
    "projects": [
      {
        "name": "Codecraft",
        "role": "Full-Stack Developer",
        "from": 2018,
        "to": 2018,
        "techStack": [
          "JavaScript",
          "HTML",
          "CSS",
          "JQuery"
        ],
        "description": "Codecraft is a strategic survival role playing game developed in pure vanilla JavaScript - with no game engines or frameworks. Codecraft was my Makers Academy final project developed by a team of 5 people in just 2 weeks.\nThe focus of the project was to learn how to create a well-designed game, as opposed to focusing on learning new technology or coming out with a polished marketable product. In the end, we created a fully working game which has been deployed online via Heroku: https://codecraft-game.herokuapp.com/.\n\nWe followed a TDD approach throughout to ensure code quality; built the game up from basic principles as we were all new to game logic (involving a lot of maths and physics); and implemented a combination of independent, pair and mob programming. I also held the role of Project Manager and was responsible for:\n* Organising and tracking daily stand-ups and retros to maintain team communication, coordination, and morale.\n* Tracked team progress to ensure the most appropriate/important features were being implemented and to schedule.\n* Monitored progress to ensure we could hit the deadline with a working and satisfactory product."
      }
    ]
  },
  {
    "employer": "Management Consultancy",
    "from": "Jul 2009",
    "to": "Jan 2018",
    "location": "Various",
    "summary": "Senior Management Consultant specialising in business change, data analysis and innovation; delivered professional services to clients in the engineering, aerospace, government and transport sectors. Please see my LinkedIn profile (link above) for more detail.",
    "projects": []
  },
  {
    "employer": "University",
    "from": "2005",
    "to": "2009",
    "location": "University of Bristol, UK",
    "summary": "Economics with Study Abroad (BSc Hons, 2:1). Core modules included microeconomics, macroeconomics, quantitative economics, and game theory. This was a 4 year sandwich course which included a year studying abroad in Spain at the \"Universitat de València\", where all modules were taken in the Spanish language.\n\nAt Bristol, I joined the university's Tae Kwon Do Club where I earned my Kukkikwon 1st Dan Black Belt, competed and won in regional and national competitions, and was Treasurer during my second year.",
    "projects": []
  },
  {
    "employer": "A-Levels",
    "from": "2003",
    "to": "2005",
    "location": "Hills Road Sixth Form College, Cambridge, UK",
    "summary": "Mathematics (A), Chemistry (A), Spanish (A), English Literature (A)",
    "projects": []
  }
]